20251220T210824--kdoc-513-フレッツの利用者は100008をローカルネットワーク内で使用できない__permanent.org
:properties:
:ID: 20251220T210824
:end:
#+title:      KDOC 513: フレッツの利用者は10.0.0.0/8をローカルネットワーク内で使用できない
#+date:       [2025-12-20 Sat 21:08]
#+filetags:   :permanent:
#+identifier: 20251220T210824

* この文書のステータス
- 作成
  - [X] 2026-01-08 貴島
- レビュー
  - [X] 2026-01-08 貴島

* 概要

NTTのフレッツ網は内部ネットワークでプライベートアドレス ~10.0.0.0/8~ を使用しているため、利用者はローカルネットワーク内で ~10.0.0.0/8~ を使用できない。

プライベートIP範囲のなかでも、もっともホスト部が大きな範囲を使用している。

- ~10.0.0.0/8~ (クラスA)
- ~172.16.0.0/12~ (クラスB)
- ~192.168.0.0/16~ (クラスC)

* 関連

- 参照: [[https://ja.wikipedia.org/wiki/IP%E3%82%A2%E3%83%89%E3%83%AC%E3%82%B9#ISP_Shared_Address][IPアドレス - Wikipedia]]から
- 疑問: なぜそうなったのか。標準仕様的に問題ないのか
- 疑問: ほかのISPだと使えるのか。クラスCしか使ったことがないが、どうやって使うのか。勝手に割り当てるのか
