20251220T210824--kdoc-513-フレッツの利用者は100008をローカルネットワーク内で使用できない__permanent.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2026-01-12T10:49:51Z -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>KDOC 513: フレッツの利用者は10.0.0.0/8をローカルネットワーク内で使用できない</title>
<meta name="author" content="kijimaD" />
<meta name="generator" content="Org Mode" />
<link rel='shortcut icon' type='image/x-icon' href='https://kijimad.github.io/roam/favicon.ico' /><link rel='stylesheet' href='https://cdn.jsdelivr.net/npm/bootstrap@5.3.3/dist/css/bootstrap.min.css' media='print' onload='this.media="all"' /><link rel='stylesheet' href='https://kijimad.github.io/roam/css/site.css' /><link rel='stylesheet' href='https://kijimad.github.io/roam/css/code.css' /><link rel='preconnect' href='https://fonts.googleapis.com'><link rel='preconnect' href='https://fonts.gstatic.com' crossorigin><link href='https://fonts.googleapis.com/css2?family=IBM+Plex+Sans+JP&display=swap' rel='stylesheet'>
</head>
<body>
<div id="preamble" class="status">
<div><div class="header"><div class="container"><div class="row"><div class="col-sm-12 col-md-12"><nav class="navbar navbar-light"/></div></div></div></div></div>
</div>
<div id="content" class="content">
<h1 class="title">KDOC 513: フレッツの利用者は10.0.0.0/8をローカルネットワーク内で使用できない</h1>
<div id="outline-container-orgfd2b671" class="outline-2">
<h2 id="orgfd2b671"><a href="#orgfd2b671">この文書のステータス</a></h2>
<div class="outline-text-2" id="text-orgfd2b671">
<ul class="org-ul">
<li>作成
<ul class="org-ul">
<li class="on"><input type='checkbox' checked='checked' /> 2026-01-08 貴島</li>
</ul></li>
<li>レビュー
<ul class="org-ul">
<li class="on"><input type='checkbox' checked='checked' /> 2026-01-08 貴島</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org5221d84" class="outline-2">
<h2 id="org5221d84"><a href="#org5221d84">概要</a></h2>
<div class="outline-text-2" id="text-org5221d84">
<p>
NTTのフレッツ網は内部ネットワークでプライベートアドレス <code>10.0.0.0/8</code> を使用しているため、利用者はローカルネットワーク内で <code>10.0.0.0/8</code> を使用できない。
</p>

<p>
プライベートIP範囲のなかでも、もっともホスト部が大きな範囲を使用している。
</p>

<ul class="org-ul">
<li><code>10.0.0.0/8</code> (クラスA)</li>
<li><code>172.16.0.0/12</code> (クラスB)</li>
<li><code>192.168.0.0/16</code> (クラスC)</li>
</ul>
</div>
</div>
<div id="outline-container-org9746516" class="outline-2">
<h2 id="org9746516"><a href="#org9746516">関連</a></h2>
<div class="outline-text-2" id="text-org9746516">
<ul class="org-ul">
<li>参照: <a href="https://ja.wikipedia.org/wiki/IP%E3%82%A2%E3%83%89%E3%83%AC%E3%82%B9#ISP_Shared_Address">IPアドレス - Wikipedia</a>から</li>
<li>疑問: なぜそうなったのか。標準仕様的に問題ないのか</li>
<li>疑問: ほかのISPだと使えるのか。クラスCしか使ったことがないが、どうやって使うのか。勝手に割り当てるのか</li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<footer class="footer py-3"><div class="container"><div class="row "><div class="col-md-4"></div><div class="col-sm col-md"><nav class="navbar"><a class="nav-link text-secondary small px-0" href="./index.html">Insomnia</a><a class="nav-link text-secondary small px-0" href="./sitemap.html">Sitemap</a><a class="nav-link text-secondary small px-0" href="https://github.com/kijimaD/roam">Repository</a><a class="nav-link text-secondary small px-0" href="https://github.com/kijimaD">@kijimaD</a></nav></div><div class="col-md-4"></div></div></div></footer>
</div>
</body>
</html>
